# 🏫GAMES101-现代计算机图形学入门

页面贡献者：[Max1122Chen](https://github.com/Max1122Chen)

更新时间：2025.10.24

## 简介

- 类型：视频课程
- 主讲老师：闫令琪，UCSB
- 前置科技：高等数学基础（微积分），线性代数基础，算法、数据结构、C/C++程序设计（作业）
- 级别：入门级~进阶级
- 难度：⭐ ⭐ 
- 面向对象：游戏引擎工程师，技术美术，其他美术相关从业者
- 所需工具：Visual Studio / Vscode （完成作业）

《GAMES101-现代计算机图形学入门》是一门主要面向计算机相关专业人士的计算机图形学入门级课程，以下引自课程网页的介绍：

> 本课程将全面而系统地介绍现代计算机图形学的四大组成部分：（1）光栅化成像，（2）几何表示，（3）光的传播理论，以及（4）动画与模拟。每个方面都会从基础原理出发讲解到实际应用，并介绍前沿的理论研究。通过本课程，你可以学习到计算机图形学背后的数学和物理知识，并锻炼实际的编程能力。
>
> 顾名思义，作为入门，本课程会尽可能的覆盖图形学的方方面面，把每一部分的基本概念都尽可能说清楚，让大家对计算机图形学有一个完整的、自上而下的全局把握。全局的理解很重要，学完本课程后，你会了解到图形学不等于 OpenGL，不等于光线追踪，而是一套生成整个虚拟世界的方法。从本课程的标题，大家还可以看到“现代”二字，也就是说，这门课所要给大家介绍的都是现代化的知识，也都是现代图形学工业界需要的图形学基础。
>
> 本课程与其它图形学教程还有一个重要的区别，那就是本课程不会讲授 OpenGL，甚至不会提及这个概念。本课程所讲授的内容是图形学背后的原理，而不是如何使用一个特定的图形学 API。在学习完这门课的时候，你一定有能力自己使用 OpenGL 写实时渲染的程序。另外，本课程并不涉及计算机视觉、图像视频处理、深度学习，也不会介绍游戏引擎与三维建模软件的使用。
>
> ——[GAMES101: 现代计算机图形学入门](https://sites.cs.ucsb.edu/~lingqi/teaching/games101.html)

如果你具有计算机相关的专业背景，或者你具有相关的知识，且你正在进行游戏引擎、图形渲染的方面的学习，笔者强烈建议你可以选修这门课程。

这门课程所教授的知识一方面有利于帮助你快速地更好了解游戏引擎/3D渲染中常常出现却让人一时摸不着头脑的的一些概念的本质和意义，例如纹理、uv映射、法线贴图、光线追踪等；另一方面，这门课可谓是高屋建瓴地介绍了计算机图形学的一些基础知识和相关应用，有利于帮助你对游戏引擎、3D渲染等建立一个更高层的认知。

## 相关资源

- 视频课程链接：[GAMES101-现代计算机图形学入门-闫令琪_哔哩哔哩_bilibili](https://www.bilibili.com/video/BV1X7411F744/?spm_id_from=333.337.search-card.all.click&vd_source=25800c8dd353f669fe131bd34020970c)
- 教材/参考书籍：[Fundamentals of Computer Graphics, 5th Edition (豆瓣)](https://book.douban.com/subject/35755152/)（非必须）



## 学习指导

可以在此留下你对读者的学习建议，包括但不限于：

- 学习用时：建议一个月

- 学习方法：

  - 课程中涉及到不少数学推导，尽管老师会带你推导，但仍然建议你可以自己下去梳理一下。
  - 课程布置了几项作业，需要有C语言编程基础，如果你满足技能要求，强烈建议你完成几项作业来加深你对图形学的理解

- 踩坑避免

  - 某些课程作业提供的原始框架存在一些问题，可能会影响实际的效果，遇到这些固有问题时可以查找解决方案，其他时候建议独立完成。

  